ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M480/TARGET_NUMAKER_PFM_M487/PeripheralPins.c
const PinMap PinMap_SPI_SSEL[] = {
    {PA_1, SPI_0, SYS_GPA_MFPL_PA1MFP_SPI0_SS},
    {PA_2, SPI_3, SYS_GPA_MFPL_PA2MFP_SPI3_SS},
    {PA_4, SPI_1, SYS_GPA_MFPL_PA4MFP_SPI1_SS},
    {PB_0, SPI_1, SYS_GPB_MFPL_PB0MFP_SPI1_SS},
    {PB_4, SPI_0, SYS_GPB_MFPL_PB4MFP_SPI0_SS},
    {PB_4, SPI_1, SYS_GPB_MFPL_PB4MFP_SPI1_SS},
    {PB_8, SPI_4, SYS_GPB_MFPH_PB8MFP_SPI4_SS},
    {PB_15, SPI_1, SYS_GPB_MFPH_PB15MFP_SPI1_SS},
    {PC_2, SPI_2, SYS_GPC_MFPL_PC2MFP_SPI2_SS},
    {PC_5, SPI_0, SYS_GPC_MFPL_PC5MFP_SPI0_SS},
    {PC_13, SPI_2, SYS_GPC_MFPH_PC13MFP_SPI2_SS},
    {PD_6, SPI_1, SYS_GPD_MFPL_PD6MFP_SPI1_SS},
    {PD_8, SPI_2, SYS_GPD_MFPH_PD8MFP_SPI2_SS},
    {PD_12, SPI_2, SYS_GPD_MFPH_PD12MFP_SPI2_SS},
    {PE_0, SPI_0, SYS_GPE_MFPL_PE0MFP_SPI0_SS},
    {PE_12, SPI_1, SYS_GPE_MFPH_PE12MFP_SPI1_SS},
    {PE_12, SPI_0, SYS_GPE_MFPH_PE12MFP_SPI0_SS},
    {PF_0, SPI_1, SYS_GPF_MFPL_PF0MFP_SPI1_SS},
    {PF_9, SPI_2, SYS_GPF_MFPH_PF9MFP_SPI2_SS},
    {PF_14, SPI_1, SYS_GPF_MFPH_PF14MFP_SPI1_SS},
    {PG_4, SPI_0, SYS_GPG_MFPL_PG4MFP_SPI0_SS},
    {PG_6, SPI_4, SYS_GPG_MFPL_PG6MFP_SPI4_SS},
    {PG_8, SPI_1, SYS_GPG_MFPH_PG8MFP_SPI1_SS},
    {PH_2, SPI_3, SYS_GPH_MFPL_PH2MFP_SPI3_SS},
    {PH_14, SPI_2, SYS_GPH_MFPH_PH14MFP_SPI2_SS},
    
    {NC,    NC,    0}
};

//*** SD ***

const PinMap PinMap_SD_CD[] = {
    {PC_6, SD_1, SYS_GPC_MFPL_PC6MFP_SD1_nCD},
    {PD_2, SD_1, SYS_GPD_MFPL_PD2MFP_SD1_nCD},
    {PD_15, SD_0, (int) SYS_GPD_MFPH_PD15MFP_SD0_nCD},
    {PE_1, SD_1, SYS_GPE_MFPL_PE1MFP_SD1_nCD},
    {PE_3, SD_0, SYS_GPE_MFPL_PE3MFP_SD0_nCD},
    {PE_4, SD_1, SYS_GPE_MFPL_PE4MFP_SD1_nCD},
    {PE_13, SD_0, SYS_GPE_MFPH_PE13MFP_SD0_nCD},
    {PF_5, SD_0, SYS_GPF_MFPL_PF5MFP_SD0_nCD},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CMD[] = {
    {PC_7, SD_1, (int) SYS_GPC_MFPL_PC7MFP_SD1_CMD},
    {PD_3, SD_1, SYS_GPD_MFPL_PD3MFP_SD1_CMD},
    {PD_6, SD_0, SYS_GPD_MFPL_PD6MFP_SD0_CMD},
    {PD_7, SD_0, (int) SYS_GPD_MFPL_PD7MFP_SD0_CMD},
    {PE_5, SD_1, SYS_GPE_MFPL_PE5MFP_SD1_CMD},
    {PE_12, SD_0, SYS_GPE_MFPH_PE12MFP_SD0_CMD},
    {PF_6, SD_0, SYS_GPF_MFPL_PF6MFP_SD0_CMD},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_CLK[] = {
    {PA_7, SD_1, (int) SYS_GPA_MFPL_PA7MFP_SD1_CLK},
    {PA_8, SD_1, SYS_GPA_MFPH_PA8MFP_SD1_CLK},
    {PC_0, SD_0, SYS_GPC_MFPL_PC0MFP_SD0_CLK},
    {PD_1, SD_1, SYS_GPD_MFPL_PD1MFP_SD1_CLK},
    {PG_7, SD_0, (int) SYS_GPG_MFPL_PG7MFP_SD0_CLK},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT0[] = {
    {PC_4, SD_0, SYS_GPC_MFPL_PC4MFP_SD0_DAT0},
    {PD_0, SD_1, SYS_GPD_MFPL_PD0MFP_SD1_DAT0},
    {PD_12, SD_0, SYS_GPD_MFPH_PD12MFP_SD0_DAT0},
    {PE_6, SD_1, SYS_GPE_MFPL_PE6MFP_SD1_DAT0},
    {PF_7, SD_0, (int) SYS_GPF_MFPL_PF7MFP_SD0_DAT0},
    {PF_9, SD_0, SYS_GPF_MFPH_PF9MFP_SD0_DAT0},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT1[] = {
    {PA_11, SD_1, SYS_GPA_MFPH_PA11MFP_SD1_DAT1},
    {PB_7, SD_1, (int) SYS_GPB_MFPL_PB7MFP_SD1_DAT1},
    {PC_3, SD_0, SYS_GPC_MFPL_PC3MFP_SD0_DAT1},
    {PD_11, SD_0, SYS_GPD_MFPH_PD11MFP_SD0_DAT1},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT2[] = {
    {PA_10, SD_1, SYS_GPA_MFPH_PA10MFP_SD1_DAT2},
    {PB_6, SD_1, SYS_GPB_MFPL_PB6MFP_SD1_DAT2},
    {PC_2, SD_0, SYS_GPC_MFPL_PC2MFP_SD0_DAT2},
    {PD_10, SD_0, SYS_GPD_MFPH_PD10MFP_SD0_DAT2},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT3[] = {
    {PA_9, SD_1, SYS_GPA_MFPH_PA9MFP_SD1_DAT3},
    {PB_5, SD_1, SYS_GPB_MFPL_PB5MFP_SD1_DAT3},
    {PC_1, SD_0, SYS_GPC_MFPL_PC1MFP_SD0_DAT3},
    {PG_8, SD_0, SYS_GPG_MFPH_PG8MFP_SD0_DAT3},

    {NC,    NC,    0}
};


//*** CAN ***

const PinMap PinMap_CAN_TD[] = {
    {PA_1, CAN_0, SYS_GPA_MFPL_PA1MFP_CAN0_TXD},
    {PA_12, CAN_0, SYS_GPA_MFPH_PA12MFP_CAN0_TXD},
    {PC_0, CAN_0, SYS_GPC_MFPL_PC0MFP_CAN0_TXD},
    {PC_2, CAN_1, SYS_GPC_MFPL_PC2MFP_CAN1_TXD},
    {PD_15, CAN_1, SYS_GPD_MFPH_PD15MFP_CAN1_TXD},
    {PF_12, CAN_0, SYS_GPF_MFPH_PF12MFP_CAN0_TXD},
    {PF_14, CAN_1, SYS_GPF_MFPH_PF14MFP_CAN1_TXD},

    {NC,    NC,     0}
};
    
const PinMap PinMap_CAN_RD[] = { 
    {PA_0, CAN_0, SYS_GPA_MFPL_PA0MFP_CAN0_RXD},
    {PA_13, CAN_0, SYS_GPA_MFPH_PA13MFP_CAN0_RXD},
    {PC_1, CAN_0, SYS_GPC_MFPL_PC1MFP_CAN0_RXD},
    {PC_3, CAN_1, SYS_GPC_MFPL_PC3MFP_CAN1_RXD},
    {PD_7, CAN_1, SYS_GPD_MFPL_PD7MFP_CAN1_RXD},
    {PF_13, CAN_0, SYS_GPF_MFPH_PF13MFP_CAN0_RXD},
    {PF_15, CAN_1, SYS_GPF_MFPH_PF15MFP_CAN1_RXD},

    {NC,    NC,    0}
};
